// Написать программу, которая принимает на вход трехзначное число и на 
// выходе показывает вторую цифру этого числа. Через строку не решаем.

Console.WriteLine("Введите трехзначное число");
int N = Convert.ToInt32(Console.ReadLine());
for (i = 0; i <= 2; int++)
{
    Console.WriteLine(i);
}